cypress/utils/requests/requests-body/EWE_Reseller_Fail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ecot="http://schema.infinity3.de/ecotel/ecotel_ts_ws_v1">
    <soapenv:Header/>
    <soapenv:Body>
        <ecot:customerProductRequest>
            <ecot:creds>
                <ecot:user>ewe_kon_retail</ecot:user>
                <ecot:password>{password}</ecot:password>
                <ecot:ticketSystemId></ecot:ticketSystemId>
            </ecot:creds>
            <ecot:capCustomerNumber>{capCustomerNumber}</ecot:capCustomerNumber>
            <ecot:capInventoryId>{capInventoryId}</ecot:capInventoryId>

        </ecot:customerProductRequest>
    </soapenv:Body>
</soapenv:Envelope>